Public Attributes | List of all members
API_ClipTran Struct Reference
Database Manager
Defines a transformation for the clipping. More...
#include <APIdefs_Database.h>
 Public Attributes
 double  | x0
offset in x direction
 double  | y0
offset in y direction
 double  | scale
scale factor
 double  | angle
rotation angle
 short  | floor
floor index
Detailed Description
Defines a transformation for the clipping.
Remarks
This is the second parameter of the ACAPI_Database_DoClip function; defines a transformation for the clipping region.